AccumulationRegisters/НакопленияПоКарточкамКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>НакопленияПоКарточкамКонтрагентов</Name>
			<Comment>Накопления по карточкам контрагентов</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧеков</Name>
					<Comment>Количество чеков в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНоменклатуры</Name>
					<Comment>Количество номенклатуры в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Карточка</Name>
					<Comment>Карточка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/НакопленияПоКарточкамКонтрагентов/Ext/RecordSetModule.bsl
// Модуль набора записей регистра накоплений "Накопления по карточкам контрагентов"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОписаниеПеременных

Перем ДокументСсылка Экспорт; // Ссылка на документ.
Перем РезультатЗапроса Экспорт; // Результат запроса.

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ВыполнитьДвижения() Экспорт
	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(РезультатЗапроса) = Тип("РезультатЗапроса") Тогда
		РезультатЗапроса = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	ВалютаНакоплений = Константы.ВалютаНакопительныхСумм.Получить();
	
	Для Каждого Строка Из РезультатЗапроса Цикл
		
		Если Строка.Сумма = 0 И Строка.КоличествоНоменклатуры = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = Добавить();
		
		НоваяЗапись.Период      = Строка.ПериодНакопления;
		НоваяЗапись.Регистратор = ДокументСсылка;
		
		НоваяЗапись.Карточка              = Строка.Карточка;
		НоваяЗапись.Контрагент            = Строка.Контрагент;
		НоваяЗапись.ПодразделениеКомпании = ДокументСсылка.ПодразделениеКомпании;
		
		НоваяЗапись.Сумма = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(Строка.Сумма,
																 ДокументСсылка.ВалютаДокумента,
																 ДокументСсылка.КурсДокумента,
																 ВалютаНакоплений,
																 Строка.ПериодНакопления);
																 
		НоваяЗапись.КоличествоНоменклатуры = Строка.КоличествоНоменклатуры;
		НоваяЗапись.КоличествоЧеков        = Строка.КоличествоЧеков;
		
		НоваяЗапись.ХозОперация = ДокументСсылка.ХозОперация;
	КонецЦикла;
	
	Записать(Истина);
КонецФункции

#КонецОбласти

#КонецЕсли
